llefaucheur/GRAPH_INTERPRETER/stream_platform/lp-mspm0l1306/platform_lp-mspm0l1306_services.c
/* ----------------------------------------------------------------------
 * Project:      CMSIS Stream
 * Title:        stream_services.c
 * Description:  computing services offered to computing nodes 
 *
 * $Date:        15 February 2023
 * $Revision:    V0.0.1
 * -------------------------------------------------------------------- */
/*
 * Copyright (C) 2010-2023 ARM Limited or its affiliates. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 * 
 */

#include "platform.h" 
#ifdef PLATFORM_MSPM0L1306

#ifdef __cplusplus
 extern "C" {
#endif


#include <stdint.h>
#include "stream_common_const.h"
#include "stream_common_types.h"
#include "stream_const.h" 
#include "stream_types.h"
#include "stream_extern.h"
#include "stream_libraries/CMSIS-DSP/Include/dsp/mspm0l1306_filtering_functions.h"




/* ------------------------------------------------------------------------------------------------------------
  @brief        Size of raw data
  @param[in]    raw type
  @return       size in bits
      
  @remark
 */

int32_t stream_bitsize_of_raw(uint8_t raw)
{
    switch (raw)
    {
    /* one bit per data */
    case STREAM_S1: case STREAM_U1: return 1;
    case STREAM_S2: case STREAM_U2: case STREAM_Q1: return 2;
    case STREAM_S4: case STREAM_U4: case STREAM_Q3: return 4;
    default:
    case STREAM_S8:   case STREAM_U8:   case STREAM_Q7:  case STREAM_FP8_E4M3: case STREAM_FP8_E5M2: return 8;
    case STREAM_S16:  case STREAM_U16:  case STREAM_Q15: case STREAM_FP16:     case STREAM_BF16:     return 16;
    case STREAM_Q23:  return 24;
    case STREAM_S32:  case STREAM_U32:  case STREAM_Q31: case STREAM_CQ15:     case STREAM_FP32:    case STREAM_CFP16: return 32;
    case STREAM_S64:  case STREAM_U64:  case STREAM_Q63: case STREAM_CQ31:     case STREAM_FP64:    case STREAM_CFP32: return 64;
    case STREAM_FP128:case STREAM_CFP64: return 128;
    case STREAM_FP256: return 256;
    }
}


/* ------------------------------------------------------------------------------------------------------------
  @brief        ITOAB integer to ASCII with Base (binary, octal, decimal, hexadecimal)
  @param[in]    integer
  @param[out]   string of char
  @return       strlen      

  @remark       usage : char string[10]; string[itaob(string,1234,C_BASE10)]='/0';
 */

uint8_t itoab(char *s, int32_t n, int base)
{
    uint8_t sign, nc, i, j, c;

     if ((sign = n) < 0)  /* save the sign */
     {    n = -n;
     }
    
     nc = 0;    /* generate digits in reverse order */
     do {       
         s[nc++] = "0123456789ABCDEF"[n % base];
     } while ((n /= base) > 0);     

     if (sign < 0)
     {  s[nc++] = '-';
     }

     /* reverse the charracters order */
     for (i = 0, j = nc-1; i < j; i++, j--) {
         c = s[i];
         s[i] = s[j];
         s[j] = c;
     }
     return nc; /* s[nc] = '\0'; to do out of the subroutine*/
}    



/**
  @brief        Internal services entry point 
  @param[in]    instance   pointers to the Stream instance and graph data
  @param[in]    command    Bit-field of command (see enum stream_command)
  @param[in]    ptr1       data pointer
  @param[in]    ptr2       data pointer
  
  @return       none
       
  @remark
 */
static void arm_stream_services_internal(uint32_t command, uint8_t *ptr1, uint8_t *ptr2, uint8_t* ptr3, uint32_t n)
{
    switch (command)
    {   case SERV_INTERNAL_NODE_REGISTER: /* called during STREAM_NODE_DECLARATION to register the NODE callback */
        {   
            #ifndef _MSC_VER 
            //rtn_addr = __builtin_return_address(0); // check the lr matches with the node 
            #endif
            break;
        }

        /* ----------------------------------------------------------------------------------
            arm_stream_services(PACK_SERVICE(instance index, NOTAG_SSRV,  SERV_INTERNAL_DEBUG_TRACE), *int8_t, 0, nb bytes);
                the Stream instance index
            arm_stream_services(DEBUG_TRACE_STAMPS, disable_0 / enable_1 time stamps);

            used to share the NODE version numbers, authors, .., real-time trace data
         */
        case SERV_INTERNAL_DEBUG_TRACE:
        {   break;
        }

        /* toggle a flag to insert/remove the time-stamps on each data pushed in the debug trace */
        case SERV_INTERNAL_DEBUG_TRACE_STAMPS:
        {   break;
        }

        /* stream format of an OUTPUT arc is changed on-the-fly : 
            update bit-fields of nchan, FS, units, interleaving, audio mapping, RAW format */
        case SERV_INTERNAL_FORMAT_UPDATE:
        {   /* checks the index of the NODE arc and update the format for the format converter or the next consumer */ 
            break;
        }

        /* at reset time : key exchanges to deobfuscate node's firmware + 
            graph/user activation key to activate specific features  
         */
        case SERV_INTERNAL_KEYEXCHANGE : 
        {   const uint32_t platform_private_key [2] = { 2452526671,  1812651256 };
            ptr1 = (uint8_t *) platform_private_key;
            break;
        }
    }
}

/**
  @brief        data flow services entry point 
  @param[in]    instance   pointers to the Stream instance and graph data
  @param[in]    command    Bit-field of command (see enum stream_command)
  @param[in]    ptr1       data pointer
  @param[in]    ptr2       data pointer
  

  @return       none
  @par          
  @remark
 */
static void arm_stream_services_flow (uint32_t command, uint8_t* ptr1, uint8_t* ptr2, uint8_t* ptr3, uint32_t n) 
{
    // SECTIONS OF ARC APIs
    /*
    * Test-pattern injection from scripts and result verification
    * Test availability of data (R/W)
    * Read/write to arcs, return the pointer to read/write for scripts
    * Data moves w/wo DMA
    */
}

/**
  @brief        data conversion services entry point
  @param[in]    instance   pointers to the Stream instance and graph data
  @param[in]    command    Bit-field of command (see enum stream_command)
  @param[in]    ptr1       data pointer
  @param[in]    ptr2       data pointer
  

  @return       none
  @par
  @remark
 */
static void arm_stream_services_conversion (uint32_t command, uint8_t* ptr1, uint8_t* ptr2, uint8_t* ptr3, uint32_t n) 
{

    switch (command)
    {
    case SERV_CONVERSION_INT16_FP32: 
    {
        /* convert ptr1 => ptr2 [ndata3] */
        break;
    }
    }
}

/**
  @brief        subset of the standard library services entry point
  @param[in]    instance   pointers to the Stream instance and graph data
  @param[in]    command    Bit-field of command (see enum stream_command)
  @param[in]    ptr1       data pointer
  @param[in]    ptr2       data pointer
  

  @return       none
  @par
  @remark
 */
void arm_stream_services_stdlib (uint32_t command, uint8_t* ptr1, uint8_t* ptr2, uint8_t* ptr3, uint32_t n) 
{
#if SERV_STDLIB
	switch (RD(command, FUNCTION_SSRV))
    {
    case STREAM_FREE:
    case STREAM_MALLOC: /* (STREAM_MALLOC + OPTION_SSRV(align, static/w/retention, speed), **ptr1, 0, 0, n) */
    case STREAM_RAND:   /* (STREAM_RAND + OPTION_SSRV(seed), *ptr1, 0, 0, n) */
    case STREAM_SRAND:
    case STREAM_ATOF:
    case STREAM_ATOI:
    case STREAM_MEMSET:
    case STREAM_STRCHR:
    case STREAM_STRLEN:
    case STREAM_STRNCAT:
    case STREAM_STRNCMP:
    case STREAM_STRNCPY:
    case STREAM_STRSTR:
    case STREAM_STRTOK:
        break;
    }
#endif
}

/**
  @brief        MATH services entry point
  @param[in]    instance   pointers to the Stream instance and graph data
  @param[in]    command    Bit-field of command (see enum stream_command)
  @param[in]    ptr1       data pointer
  @param[in]    ptr2       data pointer
  

  @return       none
  @par
  @remark
 */
void arm_stream_services_math (uint32_t command, uint8_t* ptr1, uint8_t* ptr2, uint8_t* ptr3, uint32_t n) 
{
    /* 
        Permanent APIs whatever "SERV_EXTMATH" are 
    //STREAM_SIN_Q15 STREAM_COS_Q15 STREAM_LOG10_Q15, STREAM_SQRT_Q15,
    */
    /* From Android CHRE  https://source.android.com/docs/core/interaction/contexthub
    String/array utilities: memcmp, memcpy, memmove, memset, strlen
    Math library: Commonly used single-precision floating-point functions:
    Basic operations: ceilf, fabsf, floorf, fmaxf, fminf, fmodf, roundf, lroundf, remainderf
    Exponential/power functions: expf, log2f, powf, sqrtf
    Trigonometric/hyperbolic functions: sinf, cosf, tanf, asinf, acosf, atan2f, tanhf
    */
#if SERV_EXTMATH
    //STREAM_SIN_FP32,  STREAM_COS_FP32, STREAM_ASIN_FP32, STREAM_ACOS_FP32, 
    //STREAM_TAN_FP32,  STREAM_ATAN_FP32, STREAM_ATAN2_FP32, 
    //STREAM_LOG10_FP32,STREAM_LOG2_FP32, STREAM_POW_FP32, STREAM_SQRT_FP32, 
#endif
}


/**
  @brief        multimedia audio services entry point
  @param[in]    instance   pointers to the Stream instance and graph data
  @param[in]    command    Bit-field of command (see enum stream_command)
  @param[in]    ptr1       data pointer
  @param[in]    ptr2       data pointer
  

  @return       none
  @par
  @remark
 */
void arm_stream_services_mm_audio (uint32_t command, uint8_t* ptr1, uint8_t* ptr2, uint8_t* ptr3, uint32_t n) 
{
#if SERV_EXTAUDIO

#endif
}


/**
  @brief        image processing services entry point
  @param[in]    instance   pointers to the Stream instance and graph data
  @param[in]    command    Bit-field of command (see enum stream_command)
  @param[in]    ptr1       data pointer
  @param[in]    ptr2       data pointer
  

  @return       none
  @par
  @remark
 */
void arm_stream_services_mm_image (uint32_t command, uint8_t* ptr1, uint8_t* ptr2, uint8_t* ptr3, uint32_t n) 
{
#if SERV_EXTIMAGE

#endif
}


/**
  @brief        remote debugger command interpreter (set/read parameters)
  @param[in]    
  @param[in]    
  @param[in]    
  @param[in]    
 
  @return       none
  @par
  @remark       Un/Pack data from UART 7bits format, interleave long/short answers (<100Bytes) 
                header, address, function, data[], LRCcheck, end
                2 channels interleaving, time-stamps, 6bits ASCII format payload = 192bits x n
 */
void arm_stream_command_interpreter (uint32_t command, uint8_t* ptr1, uint8_t* ptr2, uint8_t* ptr3, uint32_t n) 
{
}





