llefaucheur/GRAPH_INTERPRETER/stream_platform/lp-mspm0l1306/platform_lp-mspm0l1306_services.c
/* 
    services
    - FFT : parameters tell if tweedle factors need to be moved in TCM
    - IIR : if the number of samples to filter is small, then take the hypothesis the caller
            made the good choices for the memory mapping of memory and coefficients
            else check the address are in TCM, apply a swap to a Stream scratch are execute
            the filtering from TCM, restore / swap
    - Matrices / dotProduct : strategy to define

*/

/**
  @brief        Service entry point for nodes

  @param[in]    command    Bit-field of domain, function, options, instance (see stream_service_command) 
  @param[in]    ptr1       input data pointer or stream_xdmbuffer pointer
  @param[in]    ptr2       output data pointer
  @param[in]    ptr3       parameters data pointer
  @param[in]    n          length of data
  

  @return       none

  @par          Services of DSP/ML computing, access to stdlib, advanced DSP operations (Codec)
                and data stream interface (debug trace, access to additional arcs used for 
                control and metadata reporting).
                arm_stream_services() uses a static memory area, "SERVICES_RAM", placed after the buffers

                There are 16 families of services(COMMAND_CMD) and 256 functions per family (TAG_CMD).
                Services are an abstraction layer to CMSIS-DSP/NN and the device implementation
                   using accelerators and custom instructions. 
                For example a NODE delivered in binary for Armv7-M architecture profile will 
                    automatically scale in DSP performance when executed on Armv8.1-M through services.

                Compute services can be called from any place in the code
                Sensitive services (data moves, key exchanges, spinlock access, ..) must be called from 
                    the same placed registered at reset time with SERV_INTERNAL_SECURE_ADDRESS

  @remark
 */

void arm_stream_services (
    uint32_t command, 
    void *ptr1, 
    void *ptr2, 
    void *ptr3, 
    uint32_t n)
{   
    //arm_stream_instance_t *pinst;

    /* max 16 groups of commands */
	switch (RD(command, GROUP_SSRV))
    {
    //enum stream_service_group
    case SERV_GROUP_INTERNAL:
        
        //if ((RD(command, FUNCTION_SSRV)) == FUNCTION_SSRV)
        //{   // arm_stream_services(*ID, SERV_INTERNAL_RESET, stream_instance, 0, 0); 
        //    //#define   OPTION_SSRV_MSB U(31)       
        //    //#define   OPTION_SSRV_LSB U(14) /* 18   compute accuracy, in-place processing, frame size .. */
        //    //#define FUNCTION_SSRV_MSB U( 9)       
        //    //#define FUNCTION_SSRV_LSB U( 4) /* 6    64 functions/group  */
        //    //#define    GROUP_SSRV_MSB U( 3)       
        //    //#define    GROUP_SSRV_LSB U( 0) /* 4    16 groups */
        //    //stream_instance = *(arm_stream_instance_t*)ptr1;
        //} 
        //else
        {   /* arm_stream_services(*ID, PACK_COMMAND(TAG,PRESET,NARC,INST,SERV_INTERNAL_XXXXX), pta, ptb); */
            arm_stream_services_internal(RD(command, FUNCTION_SSRV), ptr1, ptr2, ptr3, n);
        }
        break;
    case SERV_GROUP_SCRIPT:
        arm_stream_services_flow (command, ptr1, ptr2, ptr3, n);
        break;
    case SERV_GROUP_CONVERSION:
        arm_stream_services_conversion(command, ptr1, ptr2, ptr3, n);
        break;
    case SERV_GROUP_STDLIB:
        arm_stream_services_stdlib(command, ptr1, ptr2, ptr3, n);
        break;
    case SERV_GROUP_MATH:
        arm_stream_services_math(command, ptr1, ptr2, ptr3, n);
        break;

    case SERV_GROUP_DSP_ML:
            /*  
                - IIR-DF1 biquad filter cascade, Cortex-M0's CMSIS-DSP arm_biquad_cascade_df1_q15
                - The spectral comuputation (cFFT, rFFT, DFT, window, module, dB)
                - Raw datatype conversion (int/float)
                - Matrix operations
            */
            switch (RD(command, FUNCTION_SSRV))
            {
            case SERV_CHECK_END_COMP:
                *(uint8_t *)ptr1 = 1;                      /* return a completion flag */
                break;

            case SERV_CASCADE_DF1_Q15:          /* IIR filters arm_biquad_cascade_df1_fast_q15*/
                if (RD(command,  COMMAND_SSRV) == SERV_INIT)
                {

                    //pinstance->services(                <<<========>>>          void arm_stream_services (
                    //    pinstance->iir_service,                                      uint32_t command, 
                    //    (uint8_t *)&(pinstance->TCM->biquad_casd_df1_inst_q15),      uint8_t *ptr1, 
                    //    (uint8_t *)&(pinstance->TCM->coefs[0]),                      uint8_t *ptr2, 
                    //    (uint8_t *)&(pinstance->TCM->state),                         uint8_t *ptr3, 
                    //    (postShift << 8) | numStages                                 uint32_t n)
                    //    );

                    Computer_arm_biquad_cascade_df1_init_q15(                   // void Computer_arm_biquad_cascade_df1_init_q15(
                        (Computer_arm_biquad_casd_df1_inst_q15 *) ptr1,         //         Computer_arm_biquad_casd_df1_inst_q15 * S,
                        n & 0xFF,                                               //         uint8_t numStages,
                        (const q15_t *) ptr2,                                   //   const q15_t * pCoeffs,
                        (q15_t *) ptr3,                                         //         q15_t * pState,
                        n >> 8);                                                //         int8_t postShift)

                } else //(RD(command,  COMMAND_SSRV) == SERV_RUN)
                {
                    // pinstance->services(                                        void arm_stream_services (
                    //     pinstance->iir_service,                                             uint32_t command, 
                    //     (uint8_t*)inBuf,                                              uint8_t *ptr1, 
                    //     (uint8_t*)outBuf,                                             uint8_t *ptr2, 
                    //     (uint8_t*)(&(pinstance->TCM->biquad_casd_df1_inst_q15)),      uint8_t *ptr3, 
                    //     (uint32_t)nb_data                                             uint32_t n)
                    //     );

                    Computer_arm_biquad_cascade_df1_fast_q15(                    // void stream_filter_arm_biquad_cascade_df1_fast_q15(
                        (const Computer_arm_biquad_casd_df1_inst_q15 *) ptr3,    //   const arm_biquad_casd_df1_inst_q15 * S,
                        (const q15_t *) ptr1,                                    //   const q15_t * pSrc,
                        (q15_t *) ptr2,                                          //         q15_t * pDst,
                        (uint32_t)n);                                            //         uint32_t blockSize)
                }
                break;
            case SERV_CASCADE_DF1_F32:          /* IIR filters arm_biquad_cascade_df1_f32*/
                break;
            /* ------------------------- */
            case 0:              
                // SERV_LOW_MEMORY_rFFT      /* inplace RFFT with sin/cos recomputed in each loop */
                // 
                // SERV_INIT_rFFT_Q15        /* RFFT + windowing, module, dB */
                // SERV_rFFT_Q15
                // SERV_INIT_rFFT_F32        
                // SERV_rFFT_F32
                // 
                // SERV_INIT_cFFT_Q15        /* cFFT + windowing, module, dB */
                // SERV_cFFT_Q15
                // SERV_INIT_cFFT_F32             
                // SERV_cFFT_F32
                // 
                // SERV_INIT_DFT_Q15         /* DFT/Goertzel + windowing, module, dB */
                // SERV_DFT_Q15
                // SERV_INIT_DFT_F32             
                // SERV_DFT_F32
            /* ------------------------- */
                // SERV_SQRT_Q15 
                // SERV_SQRT_F32 
                // SERV_LOG_Q15  
                // SERV_LOG_F32  
            /* ------------------------- */
                // SERV_SINE_Q15 
                // SERV_SINE_F32 
                // SERV_COS_Q15  
                // SERV_COS_F32  
                // SERV_ATAN2_Q15
                // SERV_ATAN2_F32
            /* ------------------------- */

            default: 
                break;
            }
        break;
    case SERV_GROUP_DEEPL:
        arm_stream_services_mm_audio(command, ptr1, ptr2, ptr3, n);
        break;
        
    case SERV_GROUP_MM_AUDIO:
        arm_stream_services_mm_audio(command, ptr1, ptr2, ptr3, n);
        break;
    case SERV_GROUP_MM_IMAGE:
        arm_stream_services_mm_image(command, ptr1, ptr2, ptr3, n);
        break;

        /*----------------------------------------------------------------------------
           arm_graph_interpreter interface is used for "special" services       
           examples : 
           - access to compute libraries, data converters and compression
           - access to time, stdlib, stdio for NODE delivered in binary
           - report information of change in format of the output stream (MPEG decoder)
           - access to platform IOs, data interfaces and associated services 
           - report error and metadata

            To avoid to have initialization steps when calling a complex LINK 
            service (rfft, ssrc, ..) the call to services is made with an int32 of value 
            zero at first call. STREAM will detect this value as a request for allocation 
            of memory for this instance, and make the corresponding initializations and 
            return a tag used to address the same instance on the next call. To save memory, 
            it is recommended to free this memory with FREE_INSTANCE.

            For example : int32_t ssrc_instance_id;
            arm_stream_services(SSRC_CONVERT, &(ssrc_instance_id = 0), xdmdata, parameters);
                ssrc_intance = index to an internal memory area managed by STREAM
            arm_stream_services(SSRC_CONVERT,  &ssrc_instance_id, xdmdata, parameters);
            ..
            Terminated by arm_stream_services(FREE_INSTANCE, ssrc_instance_id);  free STREAM internal memory
        */

        default:
            break;
    }
}

//
///**
//  @brief        provision for time functions
//  @param[in]    none
//  @return       none
//
//  @par          
//
//  @remark       
// */
//void al_service_time_functions (uint32_t service_command, uint8_t *pt8b, uint8_t *data, uint8_t *flag, uint32_t n)
//{   volatile uint8_t *pt8 = pt8b;
//
//    switch (service_command)
//    {   case AL_SERVICE_READ_TIME64:
//        case AL_SERVICE_READ_TIME32:
//        case AL_SERVICE_READ_TIME16:
//        {   break;
//        }
//    }
//}
//
///**
//  @brief        multiprocessing mutual exclusion services 
//  @param[in]    none
//  @return       none
//
//  @par          Usage:
//            al_service_mutual_exclusion (AL_SERVICE_MUTUAL_EXCLUSION_WR_BYTE_AND_CHECK_MP, 
//                S->pt8b_collision_arc, (*data) &check, &process_ID, 0);
//                
//  @remark       
// */
//void al_service_mutual_exclusion(uint32_t service_command, uint8_t *pt8b, uint8_t *data, uint8_t *flag, uint32_t n)
//{   
//    volatile uint8_t *pt8 = pt8b;
//
//    switch (service_command)
//    {
//        case AL_SERVICE_MUTUAL_EXCLUSION_WR_BYTE_AND_CHECK_MP:
//        {
//            /* attempt to reserve the node */
//            *pt8 = *data;    
//
//            /* check collision with all the running processes using the equivalent of lock() and unlock() 
//              Oyama Lock, "Towards more scalable mutual exclusion for multicore architectures" by Jean-Pierre Lozi */
//            //  INSTRUCTION_SYNC_BARRIER;
//            //  DATA_MEMORY_BARRIER;
//            *data = (*pt8 == *flag);
//            break;
//        }
//
//        case AL_SERVICE_MUTUAL_EXCLUSION_WR_BYTE_MP:
//        {   *(volatile uint8_t *)(pt8) = (*data); 
//            DATA_MEMORY_BARRIER; 
//            break;
//        }
//
//        default:
//        case AL_SERVICE_MUTUAL_EXCLUSION_RD_BYTE_MP:
//        {   DATA_MEMORY_BARRIER; 
//            (*data) = *(volatile uint8_t *)(pt8);
//            break;
//        }
//
//        case AL_SERVICE_MUTUAL_EXCLUSION_CLEAR_BIT_MP:
//        {   ((*pt8b) = U(*pt8b) & U(~(U(1) << U(n)))); 
//            DATA_MEMORY_BARRIER;
//            break;
//        }
//    }
//}
//
//
///**
//  @brief        Platform abstraction layer (time, spinlock, IOs)
//  @param[in]    none
//  @return       none
//
//  @par          Usage:
//                
//  @remark       
// */
//void al_services (uint32_t service_command, intPtr_t ptr1, intPtr_t ptr2, intPtr_t ptr3, uint32_t n)
//{   
//    /* max 16 groups of commands {SERV_INTERNAL .. SERV_MM_IMAGE} */
//	switch (RD(service_command, FUNCTION_SSRV))
//    {
//    case AL_SERVICE_READ_TIME:
//        al_service_time_functions(RD(service_command, FUNCTION_SSRV), (uint8_t *)ptr1, (uint8_t *)ptr2, (uint8_t *)ptr3, n);
//        break;
//    case AL_SERVICE_SLEEP_CONTROL:
//        break;
//    case AL_SERVICE_READ_MEMORY:
//        break;
//    case AL_SERVICE_SERIAL_COMMUNICATION:
//        break;
//    //enum stream_service_group
//    case AL_SERVICE_MUTUAL_EXCLUSION:
//        al_service_mutual_exclusion(RD(service_command, FUNCTION_SSRV), (uint8_t *)ptr1, (uint8_t *)ptr2, (uint8_t *)ptr3, n);
//        break;
//    case AL_SERVICE_CHANGE_IO_SETTING:
//        break;
//    }
//}


/**
  @brief         TEA 
  @param[in]     64bits data to encrypt and Key

  @return        none

  @par           

  @remark
 */
//void encrypt (uint32_t v[2], const uint32_t k[4]) {
//    uint32_t v0=v[0], v1=v[1], sum=0, i;           /* set up */
//    uint32_t delta=0x9E3779B9;                     /* a key schedule constant */
//    uint32_t k0=k[0], k1=k[1], k2=k[2], k3=k[3];   /* cache key */
//    for (i=0; i<32; i++) {                         /* basic cycle start */
//        sum += delta;
//        v0 += ((v1<<4) + k0) ^ (v1 + sum) ^ ((v1>>5) + k1);
//        v1 += ((v0<<4) + k2) ^ (v0 + sum) ^ ((v0>>5) + k3);
//    }                                              /* end cycle */
//    v[0]=v0; v[1]=v1;
//}
//
//void decrypt (uint32_t v[2], const uint32_t k[4]) {
//    uint32_t v0=v[0], v1=v[1], sum=0xC6EF3720, i;  /* set up; sum is (delta << 5) & 0xFFFFFFFF */
//    uint32_t delta=0x9E3779B9;                     /* a key schedule constant */
//    uint32_t k0=k[0], k1=k[1], k2=k[2], k3=k[3];   /* cache key */
//    for (i=0; i<32; i++) {                         /* basic cycle start */
//        v1 -= ((v0<<4) + k2) ^ (v0 + sum) ^ ((v0>>5) + k3);
//        v0 -= ((v1<<4) + k0) ^ (v1 + sum) ^ ((v1>>5) + k1);
//        sum -= delta;
//    }                                              /* end cycle */
//    v[0]=v0; v[1]=v1;
//}
/*
 * --- 4K platform signatures -------------------------------------------------------
//fwd_print_coef_col( floor((2^16) * rand(4096/16,1)), 1, 16 ); */
/*
extern const uint16_t platform_private_key_4Kbits [256] = {
 63789, 40809,  4164, 24478, 10895, 15157,  3421, 59097, 51989, 24445, 54529, 49403, 40754, 25827, 23545,  5823,
 22392, 35957, 30182, 42300, 33654, 53374,  6368, 30389, 38654, 12266, 40064,  3404, 37730, 55203, 32750, 28771,
  9768,  1853, 49589, 52173, 19238,  7550, 24582, 54322, 55166, 43597, 62923, 61808,  7385, 42486, 31509,  4359,
 58836, 32586, 50548,  3955, 17200, 42668,  8755, 41847, 25227, 50180, 42789, 25001, 19662, 22291, 60222, 29901,
 28999, 29765, 61950, 14360, 57829,  1302, 22397, 50202, 22465, 40554, 29689,   666, 39261, 39424, 42560, 22460,
 32328, 45991, 58183,  3608,  6446, 42584, 50074, 64746,  8213, 23886, 44317, 24625, 56587, 19134,  8747, 44082,
 13276, 56919, 49227, 27484,    15,  9795, 17946, 57175, 39403, 21049, 18631, 28528, 59228, 60627, 33114, 41129,
 47137,  1567, 37678,  3049, 27691, 30653,  1482,  4264, 60552, 35005, 24038, 23851,  9920,  9804, 22990, 22017,
 51382, 31898, 30461,  8601, 58090, 44207, 54733, 43023, 64481, 64211, 16394, 40931, 47726, 32648, 55694, 12512,
  8135,   182, 10023, 35006, 33464, 25245, 20355,   233, 53427, 41839, 29382, 15996, 52650, 53999, 55849, 30621,
 63615, 55131,  5147, 15571, 53580, 26596, 30560, 62359, 63242, 50153, 37652, 60026, 32468, 10879, 21364, 19427,
 36588,  4422,  4520, 10930, 62091, 53155, 46560, 63586, 65432, 64713,  9836, 62814, 34764,  4855, 20435, 58665,
 54707,   153, 41956, 52637, 16064,  4202, 17245,  6731, 31701, 27452, 24988, 58115, 27561, 18602,  3157, 14363,
 15674,  1917, 46026,   500, 40037, 26744, 16314, 42759, 20989,  6794, 35098, 10804, 57897, 43676, 55557, 49981,
 52888, 41481, 46558, 45132, 21033, 34842, 57225,  3574, 32794, 28361, 59263, 41299, 64424, 38351, 55091, 30724,
 35731, 11737, 41580, 63108, 34997, 31431, 52013,  6076, 57724,   253, 33523, 44463, 37076, 31356, 21005, 39425,

