llefaucheur/GRAPH_INTERPRETER/stream_platform/lp-mspm0l1306/platform_lp-mspm0l1306_services.c
};

extern const uint16_t platform_public_key_4Kbits [256] = {
 59844, 44729, 62045,  6493, 33490,  7217, 35734, 45140,  9661, 50958, 26152, 58870, 20122,  4001, 14383,  5428,
 62285,  1072,  7514,   813, 14170,   748, 42103, 33881, 16091, 12697,  5955, 24146,   510, 39498, 31382, 20192,
 48787, 55007, 17198, 33701, 29279, 22361, 54993, 64388, 41055, 11880,  8062, 38008, 21530, 17575, 36060, 11830,
 44465,  3649,  2231, 18777,  5071, 59019, 55483, 25932, 11089, 28210, 27277, 47760, 26638, 62377, 59767, 62351,
 22675, 19021, 58110, 13764,  8577, 34112, 59340, 26380, 14140,  5160, 61149, 39509, 24739, 43576, 51916, 21855,
 45394, 13357, 62830, 46650, 10938, 29017, 41483, 60946, 34690, 41056, 44618, 60502, 10016, 26589, 20478, 45475,
 58372, 32156, 52810, 21393, 36036, 25479, 58774, 44310, 54289,  7214, 18299, 50307, 14159,  2232, 28609, 61398,
 17176, 37338, 23563,  1758, 32795, 54199, 16972,  3007, 16152, 43301, 21588, 43220,   852, 47059, 25632,  2195,
 26608, 46943, 60380, 64488, 64449, 58740, 56734, 52491, 36371, 27451,  8331, 42901, 56620, 17996, 55060,  4637,
 24824, 17574, 10021, 41353, 20733, 62856, 32681, 48405,   835, 39672, 37778, 52912, 42923, 57555, 59137,  9976,
 12620, 51837,  3978, 25547, 19658, 48115,  6829, 51942, 51296, 34891, 16603,  4650, 41012,  1617,  4066,  8494,
 29531, 44062, 56106, 32666,  3197, 20567, 42049, 51536, 18949, 32628, 53636, 39002, 35155, 21684, 26980, 52035,
 22492, 30317, 24105, 44536, 37209, 42714, 32185, 26113, 31292,  4363, 26937, 63510, 51165, 47776, 50177, 49583,
 55264, 50472, 64137,  7298, 25957, 32247, 16914,  2422, 63857, 47607,  9697,  9692, 46191, 24968,  5007, 26924,
  9371, 52358, 60964,   309, 42601, 44468, 16621, 55258, 19264,  1760,  6114, 52290, 46622, 51341, 40889, 54094,
  2295, 26573, 16362, 31516, 57726, 18394, 39265,  1718, 10171, 54651, 12772, 54380, 22156, 43982,  3431, 48123,
};
*/

//fwd_print_coef_col( floor((2^32) * rand(4096/32,1)), 1, 8 );
/* extern const uint32_t platform_private_key_4Kbits [128] = {
  2452526671,  1812651256,  3097342766,   314126654,  2554912484,  3702164590,  1927585877,  2802798550,
  1303407119,  2608934723,  1197876299,  3434094102,  3419520323,  4097772047,  1908417888,  1962296738,
  2576194992,  3619033209,   134004925,   804319133,  4052707085,  4071294585,  1945553145,  3482499289,
  3989505788,  2889298721,  1599154964,  1742449724,  1884734392,  2914776122,  1997461852,  4094238426,
  1523416233,  1456083514,  3847689602,  2342622301,  3218149061,   536343486,  1946628721,   321046393,
  2849026241,  3022160789,  3946862637,  2834987259,  2963978059,  3666714983,  2009622596,  1969150944,
  3462191122,  3542348306,   817916835,   110265590,   244018397,   613903642,   736237871,  2687982868,
   126766851,  2028651632,  2913889510,   493014868,  1013886833,  1241591732,   741982634,  1390307210,
  3440741675,  1286916938,  3331287114,  2374132639,  2382382803,  3138106201,  3322693311,  3869108853,
   593423417,  3410533956,   813524247,   124444025,   547123825,   574390398,   551091375,  4016910224,
  1173514151,  4048776575,  2740835533,  3747491340,  1576567553,  1014479457,   804525706,  2343545747,
  1095716831,  1313502393,    66780808,  2523242149,  4134156465,  3650067967,    34103316,  2723118955,
  1543143675,   489882317,  2322795306,  1788516222,  2220921135,  3805868774,   641650540,  1866921449,
   253569750,  1636511633,  3102553242,   408533977,  2865560937,  1273030687,  2570807496,   652199330,
  1874225401,    54470065,   983646066,  1132495488,  2196382847,   923782560,  1486530232,  3211849949,
  1776482024,   239455428,  1675158111,  2037893006,  3544725485,  1304139207,  3529561772,  2429576083,
};
  extern const uint32_t platform_public_key_4Kbits [128] = {
   233567265,  1116752402,  2530180486,  2060440189,   853197903,  1026551567,  3350905477,  2651325914,
   619028480,  3075763606,  1724456980,  1985930031,  3037753086,  1723186174,    61784824,   320578255,
  2538618481,  1915561943,  3979805183,   407563859,  1612411398,  2345047264,   479654964,  3884640012,
  2719903998,  3888713398,  2708204253,    61109983,  1359261744,   480481162,  2703523561,   260745093,
  2894786147,  2050585262,  1312309229,  2217633272,  3036663210,  3494432564,  1356386492,  1337032687,
  1481664379,  2861757725,  3698274489,  3271816983,  3761693748,  3741927968,   742129130,  3651684197,
  4121400693,  3308013829,  3758162314,   289538676,  2777951414,  1391984256,  2750269047,  3778501906,
  1604761596,  3293112734,   721926701,  2232200518,  2694901321,  3066235932,  1315961252,  1132527511,
  3934205106,  2641552048,   400183835,  2695938954,   824754078,  3337037933,  3713001398,  1432722113,
   581598698,  3287656411,  1368435565,  1083961746,   859313912,   296395058,  2370438557,  1734357715,
  3221722832,  2092437210,  1652643813,   263747543,   917797964,  2335918313,  1763705179,  3869607504,
   241761720,  1904857713,  2309887215,   575785894,  2323350636,  3682368347,   850478099,   668336001,
   263615505,  2839291162,    79897738,  1250277592,  4182541487,  3284105744,  1046614510,  2929666174,
   592080613,  2705020512,  3680850077,  3864604414,  1496230894,  2088686375,  2918505406,  3024180495,
  1979481950,  1564537603,  1203729972,   327295549,  1909649709,   711703124,  1712613800,  3953881054,
  2196164463,  3926211412,   394853260,  4265062187,   414179256,  1344958243,  3373160417,  2587289407,
}; */

#ifdef __cplusplus
}
#endif

#endif